Emissão/NFe/Exemplos XML/Ex_soapconsulta NFe 4.0.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inv="InvoiCy">
	<soapenv:Header/>
	<soapenv:Body>
		<inv:recepcao.Execute>
			<inv:Invoicyrecepcao>
				<inv:Cabecalho>
					<inv:EmpPK>YPxRwGxIbpWZtwhuC0m+Wg==</inv:EmpPK>
					<inv:EmpCK>8cbbb14b354f2d844014c0debb355dd2</inv:EmpCK>
					<inv:EmpCO/>
				</inv:Cabecalho>
				<inv:Informacoes>
					<inv:Texto/>
				</inv:Informacoes>
				<inv:Dados>                              
					<inv:DadosItem>
						<inv:Documento>&lt;Consulta&gt;&lt;ModeloDocumento&gt;NFe&lt;/ModeloDocumento&gt;&lt;Versao&gt;4.00&lt;/Versao&gt;&lt;tpAmb&gt;2&lt;/tpAmb&gt;&lt;CnpjEmissor&gt;99999999999999&lt;/CnpjEmissor&gt;&lt;NumeroInicial&gt;1&lt;/NumeroInicial&gt;&lt;NumeroFinal&gt;10&lt;/NumeroFinal&gt;&lt;Serie&gt;1&lt;/Serie&gt;&lt;ChaveAcesso/&gt;&lt;DataEmissaoInicial/&gt;&lt;DataEmissaoFinal/&gt;&lt;/Consulta&gt;</inv:Documento>
						<inv:Parametros>&lt;ParametrosConsulta&gt;&lt;Situacao&gt;S&lt;/Situacao&gt;&lt;XMLCompleto&gt;S&lt;/XMLCompleto&gt;&lt;XMLLink&gt;N&lt;/XMLLink&gt;&lt;PDFBase64&gt;S&lt;/PDFBase64&gt;&lt;PDFLink&gt;N&lt;/PDFLink&gt;&lt;Eventos&gt;N&lt;/Eventos&gt;&lt;/ParametrosConsulta&gt;</inv:Parametros>
					</inv:DadosItem>
				</inv:Dados>
			</inv:Invoicyrecepcao>
		</inv:recepcao.Execute>
	</soapenv:Body>
</soapenv:Envelope>